---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.BuildingPadOverlap
source: html/aae9c5dd-448c-33b1-6109-3ffc289b5ac2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.BuildingPadOverlap Property

Pads can't overlap (but can share edges).

## Syntax (C#)
```csharp
public static FailureDefinitionId BuildingPadOverlap { get; }
```